import { ExperienceCardProps } from "../type/type";

export const experienceData: ExperienceCardProps[] = [
  {
    title: "NHN Service - Test Engineer 인턴십",
    type: ["인턴십", "QA 직무"],
    period: "2024.02 - 2024.08",
    intro:
      "'<b>우파루 오딧세이 글로벌’ 모바일 게임</b>의 QA 업무를 수행하며, <b>알파 테스트와 리그레션 테스트</b>를 통해 게임 내 기능, UI, 플레이 흐름 등의 전반적인 품질을 점검하고, 발견한 버그를 개발자에게 명확히 전달함으로써 테스트 역량과 커뮤니케이션 능력을 키웠습니다. \n또한 협업 툴 '<b>Dooray!</b>'를 활용하여 이슈를 기록하고 추적했으며, 간단한 테스트 케이스를 직접 작성하고 실행해보며 테스트 엔지니어의 실제 업무 프로세스를 실무적으로 경험할 수 있었습니다. \n이러한 경험을 통해 <b>품질 보증의 중요성</b>을 체감하고, 사용자 관점에서 문제를 발견하고 개선점을 제안하는 능력 또한 함께 향상시킬 수 있었습니다.",
    image: "/nhnservice.jpg",
  },
  {
    title: "네이버 AI Rush 앰배서더",
    type: ["대외활동", "서비스 기획", "AI"],
    period: "2024.07 - 2024.09",
    intro:
      "팀장으로서 <b>AI 기반 문해력 향상 서비스 ‘Little Star’</b>를 기획하며, 다양한 연령대에 적합한 맞춤형 자료를 빠르고 쉽게 제공하는 방안을 설계했습니다. 이를 위해 <b>사용자 요구사항을 면밀히 분석</b>하고, 각 연령대의 특성을 고려한 콘텐츠 제공 방식과 UI/UX를 설계했습니다. \n기획 과정에서는 <b>시장 내 경쟁사 분석</b>을 통해 기존 서비스들의 강점과 약점을 파악하고, 이를 바탕으로 구체적인 가설을 수립하여 서비스의 경쟁력 요소와 마케팅 전략을 도출했습니다. 또한, <b>Naver Cloud Platform</b>을 활용하여 데이터 확장 및 성능 튜닝을 직접 경험하며, 대규모 데이터 처리 및 효율적인 시스템 운영 방안을 구체적으로 익힐 수 있었습니다.",
    image: "/naver.jpg",
  },
  {
    title: "오즈코딩스쿨 초격차 캠프 6기 - 프론트엔드",
    type: ["부트캠프", "프론트엔드 교육"],
    period: "2024.08 - 2025.02",
    intro:
      "부트캠프에 참여해 <b>JavaScript, TypeScript, React, Next.js</b> 등 다양한 프론트엔드 기술을 기초부터 체계적으로 학습하고, 실전 프로젝트를 통해 직접 적용해보며 실무 역량을 키웠습니다. \n또한 수강 과정 동안 <b>블로그를 꾸준히 작성</b>하여 학습 내용을 정리하고 이해도를 높였습니다. \n마지막으로 두 차례의 실전 프로젝트를 통해 <b>프론트엔드 개발자로서 한층 더 성장</b>할 수 있는 계기가 되었습니다.",
    image: "/oz.jpg",
  },
  {
    title: "2022 국민대학교 경영정보학부 학술제 - 대상",
    type: ["교내활동", "기획", "수상"],
    period: "2022.10 - 2025.11",
    intro:
      "학술제의 주제는 ‘정보 기술(IT)을 활용하여 단체(기업, 국가, 지역사회)를 위한 <b>ESG 경영 전략</b>을 제시하라’였으며, 저희 팀은 신림동의 중장년층 인구 증가에 따른 사회적 고립과 고독사 위험에 대응하기 위해 <b>‘신림동 스마트시티화’ 전략</b>을 기획했습니다. \n그중 문화생활 추천 앱 서비스인 <b>‘다같이 신림’</b>을 포함하여 다양한 아이디어를 제안하였고, 가치 전달, 가치 창출, 비즈니스 모델 캔버스 등 생소했던 개념들을 팀원들과 함께 배우며 실무적인 관점을 넓힐 수 있었습니다. \n또한 서비스 기획 과정에서 경제성을 비롯한 다양한 핵심 요소들을 종합적으로 고려해보는 값진 경험이었습니다.",
    image: "/kmu.jpg",
  },
];
